brew "chezmoi"
brew "gh"
brew "jq"
brew "mise"
brew "starship"
brew "tree"

{{ if eq .chezmoi.os "darwin" -}}
brew "openssl@3"
brew "libyaml"
brew "tmux"
{{ end -}}

cask "1password-cli"
cask "claude-code"

{{ if eq .chezmoi.os "darwin" -}}
cask "1password"
cask "asana"
cask "cursor"
cask "displaylink"
cask "figma"
cask "intellij-idea"
cask "logi-options+"
cask "mattermost"
cask "nani"
cask "orbstack"
cask "visual-studio-code"
cask "zoom"
{{ end -}}

{{ if eq .chezmoi.os "darwin" -}}
vscode "3w36zj6.textlint"
vscode "alefragnani.bookmarks"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "clinyong.vscode-css-modules"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "jacobcassidy.css-nesting-syntax-highlighting"
vscode "kevinkyang.auto-comment-blocks"
vscode "kimuson.ts-type-expand"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rvest.vs-code-prettier-eslint"
vscode "sidthesloth.html5-boilerplate"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
{{ end -}}
